  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/setup-tf` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/2ffb56a0-58bb-4a8f-b988-5d24c33a2ba2/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.vnet.azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-vnet"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.vnet.module.firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)

    + ip_configuration {
        + name                 = "my-secure-firewall-ip-config"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.module.subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureFirewallSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-firewall-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>